# Global Configuration
cask_args appdir: "/Applications"

# Core Version Control & Shell
brew "git"          # Latest version of Git
brew "jujutsu"      # Modern alternative to Git
brew "gh"           # GitHub CLI
brew "bash"         # Modern Bash (v5+)
brew "mise"         # Polyglot runtime manager (Node, Go, Ruby, Elixir, etc.)

# Modern Unix Toolkit
brew "bat"                      # Better 'cat'
brew "eza"                      # Better 'ls'
brew "fd"                       # Better 'find'
brew "ripgrep"                  # Better 'grep'
brew "zoxide"                   # Smart 'cd'
brew "fzf"                      # Fuzzy finder
brew "tldr"                     # Practical man pages
brew "jq"                       # JSON processor
brew "yq"                       # YAML processor
brew "btop"                     # System monitor
brew "lazygit"                  # Git TUI
brew "xcodes"                   # Xcode version manager
brew "starship"                 # Cross shell prompt
brew "zsh-autosuggestions"      # Fish-like autosuggestions
brew "zsh-syntax-highlighting"  # Fish-like shell syntax highlighting
brew "ripgrep"                  # Faster grep alternative

# Tools
brew "shellcheck"       # Shell linter
brew "git-delta"        # Make diffs readable
brew "golangci-lint"    # Lint Go files

# Casks: Dev Environments
cask "ghostty"
cask "warp"
cask "zed"
cask "orbstack"
cask "bruno"

# Casks: Browsers & Security
cask "brave-browser"
cask "1password"
cask "1password-cli"

# Casks: Productivity
cask "raycast"
cask "rectangle"
cask "obsidian"
cask "discord"
cask "voiceink"

# Custom / Third-party (Ensure the formula name is exact)
brew "opencode"
