# Mac Setup Brewfile
# Automated package installation for macOS

# CLI Tools
brew "bat"           # Cat clone with syntax highlighting and Git integration
brew "eza"           # Modern replacement for ls with colors and icons
brew "fzf"           # Command-line fuzzy finder for files and history
brew "gh"            # GitHub CLI for repository management
brew "htop"          # Interactive process viewer and system monitor
brew "jq"            # Command-line JSON processor and query tool
brew "ripgrep"       # Fast text search tool that respects gitignore
brew "zoxide"        # Smarter cd command with frecency-based navigation

# Development Tools
cask "orbstack"

# GUI Applications - Productivity
cask "1password"     # Password manager with team sharing capabilities
cask "obsidian"      # Knowledge base and note-taking with markdown
cask "raycast"       # Launcher and productivity tool (Spotlight replacement)
cask "rectangle"     # Window management utility for keyboard-based resizing

# GUI Applications - Development
brew "bruno"         # Open source API testing and development platform
cask "ghostty"       # Modern terminal emulator with GPU acceleration
cask "visual-studio-code"  # Popular extensible code editor
cask "zed"           # High-performance collaborative code editor

# GUI Applications - Communication
cask "discord"       # Voice, video, and text communication platform

# GUI Applications - Browsers
cask "brave-browser" # Privacy-focused web browser based on Chromium

# GUI Applications - Utilities
cask "logi-options-plus"  # Logitech device configuration and management
cask "voiceink"          # Voice note application

# Fonts
cask "font-jetbrains-mono"
cask "font-fira-code"
cask "font-sf-mono"
